<?xml version="1.0"?>
<net name="Model231" version="11">
	<layers>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="token_type_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="token_type_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_28170404" type="Const" version="opset1">
			<data element_type="i8" shape="30000, 128" offset="0" size="3840000" />
			<output>
				<port id="0" precision="I8">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_28170405" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_28170406" type="Const" version="opset1">
			<data element_type="f32" shape="30000, 1" offset="3840000" size="120000" />
			<output>
				<port id="0" precision="FP32">
					<dim>30000</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.embeddings.word_embeddings/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>30000</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.embeddings.word_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.embeddings.word_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3960000" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="9" name="__module.embeddings.word_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>30000</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="58,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_28170408" type="Const" version="opset1">
			<data element_type="i8" shape="2, 128" offset="3960004" size="256" />
			<output>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Convert_28170409" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_28170410" type="Const" version="opset1">
			<data element_type="f32" shape="2, 1" offset="3960260" size="8" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.embeddings.token_type_embeddings/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.embeddings.token_type_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.embeddings.token_type_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3960000" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="16" name="__module.embeddings.token_type_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="60,token_type_embeddings.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="61_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_28170412" type="Const" version="opset1">
			<data element_type="i8" shape="512, 128" offset="3960268" size="65536" />
			<output>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_28170413" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_28170414" type="Const" version="opset1">
			<data element_type="f32" shape="512, 1" offset="4025804" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.embeddings.position_embeddings/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.embeddings/aten::slice/Slice" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="4027852" size="4096" />
			<output>
				<port id="0" precision="I64" names="55">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.embeddings/aten::slice/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4031948" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="ShapeOf_162951" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_163062" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4031956" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_162953" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4031948" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="Gather_162954" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="51,53,54">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.embeddings/aten::slice/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4031956" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.embeddings/aten::slice/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4031956" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.embeddings/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="56">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.embeddings.position_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.embeddings.position_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="3960000" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="33" name="__module.embeddings.position_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="63,position_embeddings.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.embeddings/aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="61,embeddings.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.embeddings.LayerNorm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="4031964" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.embeddings.LayerNorm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_162781" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="4031968" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.embeddings.LayerNorm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_162782" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="4032480" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.embeddings.LayerNorm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="68,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 128" offset="4032992" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4033504" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="44" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4033508" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="45" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4033504" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="46" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4033508" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="__module.embeddings.LayerNorm/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_28170416" type="Const" version="opset1">
			<data element_type="i8" shape="768, 128" offset="4033512" size="98304" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_28170417" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_28170418" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="4131816" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.encoder.embedding_hidden_mapping_in/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.encoder.embedding_hidden_mapping_in/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_162783" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="4134888" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.encoder.embedding_hidden_mapping_in/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="95,hidden_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="56" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="57" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_28170420" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="4137968" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Convert_28170421" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_28170422" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="4727792" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_162784" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="4730864" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="110,x.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4733936" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="68" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4733940" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4733936" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="70" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4733940" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="71" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.query/aten::linear/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733944" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="120,x.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_155145" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733976" size="32" />
			<output>
				<port id="0" precision="I64" names="121">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="77" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="78" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_28170424" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="4734008" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Convert_28170425" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_28170426" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="5323832" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_162785" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="5326904" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113,x.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5329976" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="89" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5329980" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="90" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5329976" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="91" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5329980" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="92" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.key/aten::linear/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/prim::ListConstruct/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733944" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="126,x.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_155164" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733976" size="32" />
			<output>
				<port id="0" precision="I64" names="127">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128,key_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="136,attention_scores.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_162786" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="5329984" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="137,attention_scores.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_162788" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="5329988" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4031956" size="8" />
			<output>
				<port id="0" precision="I64" names="8" />
			</output>
		</layer>
		<layer id="102" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="9">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="10" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="5329992" size="8" />
			<output>
				<port id="0" precision="I64" names="10" />
			</output>
		</layer>
		<layer id="104" name="aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="11,extended_attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="16">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_162787" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="5329988" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="aten::rsub/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="19">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_162789" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="5330000" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="21,attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="138,input.3">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="139,input.5">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137960" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4137964" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="117" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_28170428" type="Const" version="opset1">
			<data element_type="i8" shape="768, 768" offset="5330004" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Convert_28170429" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_28170430" type="Const" version="opset1">
			<data element_type="f32" shape="768, 1" offset="5919828" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_162790" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="5922900" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention.value/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="116,x.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/prim::ListConstruct/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733944" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132,x.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_155183" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4733976" size="32" />
			<output>
				<port id="0" precision="I64" names="133">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::permute/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="134">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.encoder.albert_layer_groups.0.albert_layers.0.attention/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
